#loc = loc(unknown)
module @SyncTensorsGraph.1433 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<1000xbf16> loc(unknown), %arg1: tensor<1000x1024xbf16> loc(unknown), %arg2: tensor<1024xbf16> loc(unknown), %arg3: tensor<1024x1024x1x1xbf16> loc(unknown), %arg4: tensor<1024xbf16> loc(unknown), %arg5: tensor<1024xbf16> loc(unknown), %arg6: tensor<1024xbf16> loc(unknown), %arg7: tensor<1024xbf16> loc(unknown), %arg8: tensor<1024x1440x1x1xbf16> loc(unknown), %arg9: tensor<224xbf16> loc(unknown), %arg10: tensor<224xbf16> loc(unknown), %arg11: tensor<224xbf16> loc(unknown), %arg12: tensor<224xbf16> loc(unknown), %arg13: tensor<224x224x1x1xbf16> loc(unknown), %arg14: tensor<224x1x3x3xbf16> loc(unknown), %arg15: tensor<224xbf16> loc(unknown), %arg16: tensor<224xbf16> loc(unknown), %arg17: tensor<224xbf16> loc(unknown), %arg18: tensor<224xbf16> loc(unknown), %arg19: tensor<224x224x1x1xbf16> loc(unknown), %arg20: tensor<224x1x3x3xbf16> loc(unknown), %arg21: tensor<224xbf16> loc(unknown), %arg22: tensor<224xbf16> loc(unknown), %arg23: tensor<224xbf16> loc(unknown), %arg24: tensor<224xbf16> loc(unknown), %arg25: tensor<224x224x1x1xbf16> loc(unknown), %arg26: tensor<224x1x3x3xbf16> loc(unknown), %arg27: tensor<224xbf16> loc(unknown), %arg28: tensor<224xbf16> loc(unknown), %arg29: tensor<224xbf16> loc(unknown), %arg30: tensor<224xbf16> loc(unknown), %arg31: tensor<224x768x1x1xbf16> loc(unknown), %arg32: tensor<768xbf16> loc(unknown), %arg33: tensor<768x768x1x1xbf16> loc(unknown), %arg34: tensor<768xbf16> loc(unknown), %arg35: tensor<768xbf16> loc(unknown), %arg36: tensor<768xbf16> loc(unknown), %arg37: tensor<768xbf16> loc(unknown), %arg38: tensor<768x1088x1x1xbf16> loc(unknown), %arg39: tensor<192xbf16> loc(unknown), %arg40: tensor<192xbf16> loc(unknown), %arg41: tensor<192xbf16> loc(unknown), %arg42: tensor<192xbf16> loc(unknown), %arg43: tensor<192x192x1x1xbf16> loc(unknown), %arg44: tensor<192x1x3x3xbf16> loc(unknown), %arg45: tensor<192xbf16> loc(unknown), %arg46: tensor<192xbf16> loc(unknown), %arg47: tensor<192xbf16> loc(unknown), %arg48: tensor<192xbf16> loc(unknown), %arg49: tensor<192x192x1x1xbf16> loc(unknown), %arg50: tensor<192x1x3x3xbf16> loc(unknown), %arg51: tensor<192xbf16> loc(unknown), %arg52: tensor<192xbf16> loc(unknown), %arg53: tensor<192xbf16> loc(unknown), %arg54: tensor<192xbf16> loc(unknown), %arg55: tensor<192x192x1x1xbf16> loc(unknown), %arg56: tensor<192x1x3x3xbf16> loc(unknown), %arg57: tensor<192xbf16> loc(unknown), %arg58: tensor<192xbf16> loc(unknown), %arg59: tensor<192xbf16> loc(unknown), %arg60: tensor<192xbf16> loc(unknown), %arg61: tensor<192x512x1x1xbf16> loc(unknown), %arg62: tensor<512xbf16> loc(unknown), %arg63: tensor<512x512x1x1xbf16> loc(unknown), %arg64: tensor<512xbf16> loc(unknown), %arg65: tensor<512xbf16> loc(unknown), %arg66: tensor<512xbf16> loc(unknown), %arg67: tensor<512xbf16> loc(unknown), %arg68: tensor<512x736x1x1xbf16> loc(unknown), %arg69: tensor<160xbf16> loc(unknown), %arg70: tensor<160xbf16> loc(unknown), %arg71: tensor<160xbf16> loc(unknown), %arg72: tensor<160xbf16> loc(unknown), %arg73: tensor<160x160x1x1xbf16> loc(unknown), %arg74: tensor<160x1x3x3xbf16> loc(unknown), %arg75: tensor<160xbf16> loc(unknown), %arg76: tensor<160xbf16> loc(unknown), %arg77: tensor<160xbf16> loc(unknown), %arg78: tensor<160xbf16> loc(unknown), %arg79: tensor<160x160x1x1xbf16> loc(unknown), %arg80: tensor<160x1x3x3xbf16> loc(unknown), %arg81: tensor<160xbf16> loc(unknown), %arg82: tensor<160xbf16> loc(unknown), %arg83: tensor<160xbf16> loc(unknown), %arg84: tensor<160xbf16> loc(unknown), %arg85: tensor<160x160x1x1xbf16> loc(unknown), %arg86: tensor<160x1x3x3xbf16> loc(unknown), %arg87: tensor<160xbf16> loc(unknown), %arg88: tensor<160xbf16> loc(unknown), %arg89: tensor<160xbf16> loc(unknown), %arg90: tensor<160xbf16> loc(unknown), %arg91: tensor<160x256x1x1xbf16> loc(unknown), %arg92: tensor<256xbf16> loc(unknown), %arg93: tensor<256x256x1x1xbf16> loc(unknown), %arg94: tensor<256xbf16> loc(unknown), %arg95: tensor<256xbf16> loc(unknown), %arg96: tensor<256xbf16> loc(unknown), %arg97: tensor<256xbf16> loc(unknown), %arg98: tensor<256x448x1x1xbf16> loc(unknown), %arg99: tensor<128xbf16> loc(unknown), %arg100: tensor<128xbf16> loc(unknown), %arg101: tensor<128xbf16> loc(unknown), %arg102: tensor<128xbf16> loc(unknown), %arg103: tensor<128x128x1x1xbf16> loc(unknown), %arg104: tensor<128x1x3x3xbf16> loc(unknown), %arg105: tensor<128xbf16> loc(unknown), %arg106: tensor<128xbf16> loc(unknown), %arg107: tensor<128xbf16> loc(unknown), %arg108: tensor<128xbf16> loc(unknown), %arg109: tensor<128x128x1x1xbf16> loc(unknown), %arg110: tensor<128x1x3x3xbf16> loc(unknown), %arg111: tensor<128xbf16> loc(unknown), %arg112: tensor<128xbf16> loc(unknown), %arg113: tensor<128xbf16> loc(unknown), %arg114: tensor<128xbf16> loc(unknown), %arg115: tensor<128x128x1x1xbf16> loc(unknown), %arg116: tensor<128x1x3x3xbf16> loc(unknown), %arg117: tensor<128xbf16> loc(unknown), %arg118: tensor<128xbf16> loc(unknown), %arg119: tensor<128xbf16> loc(unknown), %arg120: tensor<128xbf16> loc(unknown), %arg121: tensor<128x64x1x1xbf16> loc(unknown), %arg122: tensor<64xbf16> loc(unknown), %arg123: tensor<64xbf16> loc(unknown), %arg124: tensor<64xbf16> loc(unknown), %arg125: tensor<64xbf16> loc(unknown), %arg126: tensor<64x64x1x1xbf16> loc(unknown), %arg127: tensor<64x1x3x3xbf16> loc(unknown), %arg128: tensor<64xbf16> loc(unknown), %arg129: tensor<64xbf16> loc(unknown), %arg130: tensor<64xbf16> loc(unknown), %arg131: tensor<64xbf16> loc(unknown), %arg132: tensor<64x64x1x1xbf16> loc(unknown), %arg133: tensor<64x1x3x3xbf16> loc(unknown), %arg134: tensor<64xbf16> loc(unknown), %arg135: tensor<64xbf16> loc(unknown), %arg136: tensor<64xbf16> loc(unknown), %arg137: tensor<64xbf16> loc(unknown), %arg138: tensor<64x3x3x3xbf16> loc(unknown), %arg139: tensor<1x3x224x224xbf16> loc(unknown)) -> tensor<1x1000xbf16> {
    %cst = stablehlo.constant dense<0.0204081628> : tensor<1x1024xf32> loc(#loc)
    %cst_0 = stablehlo.constant dense<6.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.40282347E+38> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<3.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_3 = stablehlo.constant dense<2.038570e-02> : tensor<1x1024xbf16> loc(#loc)
    %cst_4 = stablehlo.constant dense<0.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_5 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_6 = stablehlo.constant dense<0.000000e+00> : tensor<1x1024x7x7xbf16> loc(#loc)
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<1x224x7x7xbf16> loc(#loc)
    %cst_8 = stablehlo.constant dense<6.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_9 = stablehlo.constant dense<3.40282347E+38> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_10 = stablehlo.constant dense<3.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_11 = stablehlo.constant dense<5.096440e-03> : tensor<1x768xbf16> loc(#loc)
    %cst_12 = stablehlo.constant dense<0.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_13 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_14 = stablehlo.constant dense<0.000000e+00> : tensor<1x768x14x14xbf16> loc(#loc)
    %cst_15 = stablehlo.constant dense<0.000000e+00> : tensor<1x192x14x14xbf16> loc(#loc)
    %cst_16 = stablehlo.constant dense<6.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_17 = stablehlo.constant dense<3.40282347E+38> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_18 = stablehlo.constant dense<3.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_19 = stablehlo.constant dense<1.274110e-03> : tensor<1x512xbf16> loc(#loc)
    %cst_20 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_21 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_22 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x28x28xbf16> loc(#loc)
    %cst_23 = stablehlo.constant dense<0.000000e+00> : tensor<1x160x28x28xbf16> loc(#loc)
    %cst_24 = stablehlo.constant dense<6.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_25 = stablehlo.constant dense<3.40282347E+38> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_26 = stablehlo.constant dense<3.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_27 = stablehlo.constant dense<3.185270e-04> : tensor<1x256xbf16> loc(#loc)
    %cst_28 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_29 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_30 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x56x56xbf16> loc(#loc)
    %cst_31 = stablehlo.constant dense<0.000000e+00> : tensor<1x128x56x56xbf16> loc(#loc)
    %cst_32 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x56x56xbf16> loc(#loc)
    %cst_33 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x112x112xbf16> loc(#loc)
    %cst_34 = stablehlo.constant dense<0xFF80> : tensor<bf16> loc(#loc)
    %cst_35 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_36 = stablehlo.constant dense<0.000000e+00> : tensor<bf16> loc(#loc)
    %0 = stablehlo.reshape %arg134 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %1 = stablehlo.reshape %0 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %2 = stablehlo.reshape %arg128 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %3 = stablehlo.reshape %2 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %4 = stablehlo.reshape %arg122 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %5 = stablehlo.reshape %4 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %6 = stablehlo.reshape %arg117 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %7 = stablehlo.reshape %6 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %8 = stablehlo.reshape %arg111 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %9 = stablehlo.reshape %8 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %10 = stablehlo.reshape %arg105 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %11 = stablehlo.reshape %10 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %12 = stablehlo.reshape %arg99 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %13 = stablehlo.reshape %12 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %14 = stablehlo.reshape %arg94 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc)
    %15 = stablehlo.reshape %14 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc)
    %16 = stablehlo.convolution(%arg139, %arg138) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x3x224x224xbf16>, tensor<64x3x3x3xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc)
    %17 = stablehlo.reshape %arg137 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %18 = stablehlo.reshape %17 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %19 = stablehlo.reshape %arg136 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %20 = stablehlo.reshape %19 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %21 = stablehlo.reshape %arg135 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %22 = stablehlo.reshape %21 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %23 = "stablehlo.batch_norm_inference"(%16, %18, %20, %22, %1) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x112x112xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc)
    %24 = stablehlo.maximum %23, %cst_33 : tensor<1x64x112x112xbf16> loc(#loc)
    %25 = stablehlo.convolution(%24, %arg133) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 64 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x1x3x3xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc)
    %26 = stablehlo.convolution(%25, %arg132) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x64x1x1xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc)
    %27 = stablehlo.reshape %arg131 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %28 = stablehlo.reshape %27 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %29 = stablehlo.reshape %arg130 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %30 = stablehlo.reshape %29 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %31 = stablehlo.reshape %arg129 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %32 = stablehlo.reshape %31 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %33 = "stablehlo.batch_norm_inference"(%26, %28, %30, %32, %3) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x112x112xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc)
    %34 = stablehlo.maximum %33, %cst_33 : tensor<1x64x112x112xbf16> loc(#loc)
    %35 = stablehlo.convolution(%34, %arg127) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 64 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x1x3x3xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc)
    %36 = stablehlo.convolution(%35, %arg126) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xbf16>, tensor<64x64x1x1xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc)
    %37 = stablehlo.reshape %arg125 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %38 = stablehlo.reshape %37 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %39 = stablehlo.reshape %arg124 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %40 = stablehlo.reshape %39 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %41 = stablehlo.reshape %arg123 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc)
    %42 = stablehlo.reshape %41 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc)
    %43 = "stablehlo.batch_norm_inference"(%36, %38, %40, %42, %5) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc)
    %44 = stablehlo.maximum %43, %cst_32 : tensor<1x64x56x56xbf16> loc(#loc)
    %45 = stablehlo.convolution(%44, %arg121) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xbf16>, tensor<128x64x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %46 = stablehlo.reshape %arg120 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %47 = stablehlo.reshape %46 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %48 = stablehlo.reshape %arg119 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %49 = stablehlo.reshape %48 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %50 = stablehlo.reshape %arg118 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %51 = stablehlo.reshape %50 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %52 = "stablehlo.batch_norm_inference"(%45, %47, %49, %51, %7) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %53 = stablehlo.maximum %52, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc)
    %54 = stablehlo.convolution(%53, %arg116) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %55 = stablehlo.convolution(%54, %arg115) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %56 = stablehlo.reshape %arg114 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %57 = stablehlo.reshape %56 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %58 = stablehlo.reshape %arg113 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %59 = stablehlo.reshape %58 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %60 = stablehlo.reshape %arg112 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %61 = stablehlo.reshape %60 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %62 = "stablehlo.batch_norm_inference"(%55, %57, %59, %61, %9) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %63 = stablehlo.maximum %62, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc)
    %64 = stablehlo.convolution(%63, %arg110) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %65 = stablehlo.convolution(%64, %arg109) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %66 = stablehlo.reshape %arg108 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %67 = stablehlo.reshape %66 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %68 = stablehlo.reshape %arg107 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %69 = stablehlo.reshape %68 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %70 = stablehlo.reshape %arg106 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %71 = stablehlo.reshape %70 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %72 = "stablehlo.batch_norm_inference"(%65, %67, %69, %71, %11) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %73 = stablehlo.maximum %72, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc)
    %74 = stablehlo.convolution(%73, %arg104) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %75 = stablehlo.convolution(%74, %arg103) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %76 = stablehlo.reshape %arg102 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %77 = stablehlo.reshape %76 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %78 = stablehlo.reshape %arg101 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %79 = stablehlo.reshape %78 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %80 = stablehlo.reshape %arg100 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc)
    %81 = stablehlo.reshape %80 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc)
    %82 = "stablehlo.batch_norm_inference"(%75, %77, %79, %81, %13) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc)
    %83 = stablehlo.maximum %82, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc)
    %84 = stablehlo.concatenate %44, %63, %73, %83, dim = 1 : (tensor<1x64x56x56xbf16>, tensor<1x128x56x56xbf16>, tensor<1x128x56x56xbf16>, tensor<1x128x56x56xbf16>) -> tensor<1x448x56x56xbf16> loc(#loc)
    %85 = stablehlo.convolution(%84, %arg98) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x448x56x56xbf16>, tensor<256x448x1x1xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc)
    %86 = stablehlo.reshape %arg97 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc)
    %87 = stablehlo.reshape %86 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc)
    %88 = stablehlo.reshape %arg96 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc)
    %89 = stablehlo.reshape %88 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc)
    %90 = stablehlo.reshape %arg95 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc)
    %91 = stablehlo.reshape %90 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc)
    %92 = "stablehlo.batch_norm_inference"(%85, %87, %89, %91, %15) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc)
    %93 = stablehlo.maximum %92, %cst_30 : tensor<1x256x56x56xbf16> loc(#loc)
    %94 = stablehlo.reduce(%93 init: %cst_36) applies stablehlo.add across dimensions = [2, 3] : (tensor<1x256x56x56xbf16>, tensor<bf16>) -> tensor<1x256xbf16> loc(#loc)
    %95 = stablehlo.multiply %94, %cst_27 : tensor<1x256xbf16> loc(#loc)
    %96 = stablehlo.reshape %95 : (tensor<1x256xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc)
    %97 = stablehlo.convolution(%96, %arg93) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x1x1xbf16>, tensor<256x256x1x1xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc)
    %98 = stablehlo.reshape %arg92 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc)
    %99 = stablehlo.reshape %98 : (tensor<1x1x256xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc)
    %100 = stablehlo.add %97, %99 : tensor<1x256x1x1xbf16> loc(#loc)
    %101 = stablehlo.convert %100 : (tensor<1x256x1x1xbf16>) -> tensor<1x256x1x1xf32> loc(#loc)
    %102 = stablehlo.add %101, %cst_26 : tensor<1x256x1x1xf32> loc(#loc)
    %103 = stablehlo.clamp %cst_28, %102, %cst_25 : tensor<1x256x1x1xf32> loc(#loc)
    %104 = stablehlo.clamp %cst_29, %103, %cst_24 : tensor<1x256x1x1xf32> loc(#loc)
    %105 = stablehlo.divide %104, %cst_24 : tensor<1x256x1x1xf32> loc(#loc)
    %106 = stablehlo.convert %105 : (tensor<1x256x1x1xf32>) -> tensor<1x256x1x1xbf16> loc(#loc)
    %107 = stablehlo.reshape %106 : (tensor<1x256x1x1xbf16>) -> tensor<1x256xbf16> loc(#loc)
    %108 = stablehlo.broadcast_in_dim %107, dims = [0, 1] : (tensor<1x256xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc)
    %109 = stablehlo.multiply %93, %108 : tensor<1x256x56x56xbf16> loc(#loc)
    %110 = stablehlo.pad %109, %cst_34, low = [0, 0, 0, 0], high = [0, 0, 1, 1], interior = [0, 0, 0, 0] : (tensor<1x256x56x56xbf16>, tensor<bf16>) -> tensor<1x256x57x57xbf16> loc(#loc)
    %111 = "stablehlo.reduce_window"(%110, %cst_34) <{window_dimensions = array<i64: 1, 1, 3, 3>, window_strides = array<i64: 1, 1, 2, 2>}> ({
    ^bb0(%arg140: tensor<bf16> loc(unknown), %arg141: tensor<bf16> loc(unknown)):
      %359 = stablehlo.maximum %arg140, %arg141 : tensor<bf16> loc(#loc)
      stablehlo.return %359 : tensor<bf16> loc(#loc)
    }) : (tensor<1x256x57x57xbf16>, tensor<bf16>) -> tensor<1x256x28x28xbf16> loc(#loc)
    %112 = stablehlo.reshape %arg87 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %113 = stablehlo.reshape %112 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %114 = stablehlo.reshape %arg81 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %115 = stablehlo.reshape %114 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %116 = stablehlo.reshape %arg75 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %117 = stablehlo.reshape %116 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %118 = stablehlo.reshape %arg69 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %119 = stablehlo.reshape %118 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %120 = stablehlo.reshape %arg64 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc)
    %121 = stablehlo.reshape %120 : (tensor<1x1x512xbf16>) -> tensor<512xbf16> loc(#loc)
    %122 = stablehlo.convolution(%111, %arg91) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x28x28xbf16>, tensor<160x256x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %123 = stablehlo.reshape %arg90 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %124 = stablehlo.reshape %123 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %125 = stablehlo.reshape %arg89 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %126 = stablehlo.reshape %125 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %127 = stablehlo.reshape %arg88 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %128 = stablehlo.reshape %127 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %129 = "stablehlo.batch_norm_inference"(%122, %124, %126, %128, %113) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %130 = stablehlo.maximum %129, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc)
    %131 = stablehlo.convolution(%130, %arg86) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 160 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x1x3x3xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %132 = stablehlo.convolution(%131, %arg85) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x160x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %133 = stablehlo.reshape %arg84 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %134 = stablehlo.reshape %133 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %135 = stablehlo.reshape %arg83 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %136 = stablehlo.reshape %135 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %137 = stablehlo.reshape %arg82 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %138 = stablehlo.reshape %137 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %139 = "stablehlo.batch_norm_inference"(%132, %134, %136, %138, %115) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %140 = stablehlo.maximum %139, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc)
    %141 = stablehlo.convolution(%140, %arg80) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 160 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x1x3x3xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %142 = stablehlo.convolution(%141, %arg79) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x160x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %143 = stablehlo.reshape %arg78 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %144 = stablehlo.reshape %143 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %145 = stablehlo.reshape %arg77 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %146 = stablehlo.reshape %145 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %147 = stablehlo.reshape %arg76 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %148 = stablehlo.reshape %147 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %149 = "stablehlo.batch_norm_inference"(%142, %144, %146, %148, %117) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %150 = stablehlo.maximum %149, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc)
    %151 = stablehlo.convolution(%150, %arg74) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 160 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x1x3x3xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %152 = stablehlo.convolution(%151, %arg73) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x160x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %153 = stablehlo.reshape %arg72 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %154 = stablehlo.reshape %153 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %155 = stablehlo.reshape %arg71 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %156 = stablehlo.reshape %155 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %157 = stablehlo.reshape %arg70 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc)
    %158 = stablehlo.reshape %157 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc)
    %159 = "stablehlo.batch_norm_inference"(%152, %154, %156, %158, %119) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc)
    %160 = stablehlo.maximum %159, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc)
    %161 = stablehlo.concatenate %111, %140, %150, %160, dim = 1 : (tensor<1x256x28x28xbf16>, tensor<1x160x28x28xbf16>, tensor<1x160x28x28xbf16>, tensor<1x160x28x28xbf16>) -> tensor<1x736x28x28xbf16> loc(#loc)
    %162 = stablehlo.convolution(%161, %arg68) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x736x28x28xbf16>, tensor<512x736x1x1xbf16>) -> tensor<1x512x28x28xbf16> loc(#loc)
    %163 = stablehlo.reshape %arg67 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc)
    %164 = stablehlo.reshape %163 : (tensor<1x1x512xbf16>) -> tensor<512xbf16> loc(#loc)
    %165 = stablehlo.reshape %arg66 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc)
    %166 = stablehlo.reshape %165 : (tensor<1x1x512xbf16>) -> tensor<512xbf16> loc(#loc)
    %167 = stablehlo.reshape %arg65 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc)
    %168 = stablehlo.reshape %167 : (tensor<1x1x512xbf16>) -> tensor<512xbf16> loc(#loc)
    %169 = "stablehlo.batch_norm_inference"(%162, %164, %166, %168, %121) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xbf16>, tensor<512xbf16>, tensor<512xbf16>, tensor<512xbf16>, tensor<512xbf16>) -> tensor<1x512x28x28xbf16> loc(#loc)
    %170 = stablehlo.maximum %169, %cst_22 : tensor<1x512x28x28xbf16> loc(#loc)
    %171 = stablehlo.reduce(%170 init: %cst_36) applies stablehlo.add across dimensions = [2, 3] : (tensor<1x512x28x28xbf16>, tensor<bf16>) -> tensor<1x512xbf16> loc(#loc)
    %172 = stablehlo.multiply %171, %cst_19 : tensor<1x512xbf16> loc(#loc)
    %173 = stablehlo.reshape %172 : (tensor<1x512xbf16>) -> tensor<1x512x1x1xbf16> loc(#loc)
    %174 = stablehlo.convolution(%173, %arg63) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x1x1xbf16>, tensor<512x512x1x1xbf16>) -> tensor<1x512x1x1xbf16> loc(#loc)
    %175 = stablehlo.reshape %arg62 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc)
    %176 = stablehlo.reshape %175 : (tensor<1x1x512xbf16>) -> tensor<1x512x1x1xbf16> loc(#loc)
    %177 = stablehlo.add %174, %176 : tensor<1x512x1x1xbf16> loc(#loc)
    %178 = stablehlo.convert %177 : (tensor<1x512x1x1xbf16>) -> tensor<1x512x1x1xf32> loc(#loc)
    %179 = stablehlo.add %178, %cst_18 : tensor<1x512x1x1xf32> loc(#loc)
    %180 = stablehlo.clamp %cst_20, %179, %cst_17 : tensor<1x512x1x1xf32> loc(#loc)
    %181 = stablehlo.clamp %cst_21, %180, %cst_16 : tensor<1x512x1x1xf32> loc(#loc)
    %182 = stablehlo.divide %181, %cst_16 : tensor<1x512x1x1xf32> loc(#loc)
    %183 = stablehlo.convert %182 : (tensor<1x512x1x1xf32>) -> tensor<1x512x1x1xbf16> loc(#loc)
    %184 = stablehlo.reshape %183 : (tensor<1x512x1x1xbf16>) -> tensor<1x512xbf16> loc(#loc)
    %185 = stablehlo.broadcast_in_dim %184, dims = [0, 1] : (tensor<1x512xbf16>) -> tensor<1x512x28x28xbf16> loc(#loc)
    %186 = stablehlo.multiply %170, %185 : tensor<1x512x28x28xbf16> loc(#loc)
    %187 = stablehlo.pad %186, %cst_34, low = [0, 0, 0, 0], high = [0, 0, 1, 1], interior = [0, 0, 0, 0] : (tensor<1x512x28x28xbf16>, tensor<bf16>) -> tensor<1x512x29x29xbf16> loc(#loc)
    %188 = "stablehlo.reduce_window"(%187, %cst_34) <{window_dimensions = array<i64: 1, 1, 3, 3>, window_strides = array<i64: 1, 1, 2, 2>}> ({
    ^bb0(%arg140: tensor<bf16> loc(unknown), %arg141: tensor<bf16> loc(unknown)):
      %359 = stablehlo.maximum %arg140, %arg141 : tensor<bf16> loc(#loc)
      stablehlo.return %359 : tensor<bf16> loc(#loc)
    }) : (tensor<1x512x29x29xbf16>, tensor<bf16>) -> tensor<1x512x14x14xbf16> loc(#loc)
    %189 = stablehlo.reshape %arg57 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %190 = stablehlo.reshape %189 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %191 = stablehlo.reshape %arg51 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %192 = stablehlo.reshape %191 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %193 = stablehlo.reshape %arg45 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %194 = stablehlo.reshape %193 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %195 = stablehlo.reshape %arg39 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %196 = stablehlo.reshape %195 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %197 = stablehlo.reshape %arg34 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc)
    %198 = stablehlo.reshape %197 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc)
    %199 = stablehlo.convolution(%188, %arg61) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x14x14xbf16>, tensor<192x512x1x1xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %200 = stablehlo.reshape %arg60 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %201 = stablehlo.reshape %200 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %202 = stablehlo.reshape %arg59 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %203 = stablehlo.reshape %202 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %204 = stablehlo.reshape %arg58 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %205 = stablehlo.reshape %204 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %206 = "stablehlo.batch_norm_inference"(%199, %201, %203, %205, %190) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x192x14x14xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %207 = stablehlo.maximum %206, %cst_15 : tensor<1x192x14x14xbf16> loc(#loc)
    %208 = stablehlo.convolution(%207, %arg56) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x1x3x3xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %209 = stablehlo.convolution(%208, %arg55) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x192x1x1xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %210 = stablehlo.reshape %arg54 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %211 = stablehlo.reshape %210 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %212 = stablehlo.reshape %arg53 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %213 = stablehlo.reshape %212 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %214 = stablehlo.reshape %arg52 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %215 = stablehlo.reshape %214 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %216 = "stablehlo.batch_norm_inference"(%209, %211, %213, %215, %192) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x192x14x14xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %217 = stablehlo.maximum %216, %cst_15 : tensor<1x192x14x14xbf16> loc(#loc)
    %218 = stablehlo.convolution(%217, %arg50) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x1x3x3xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %219 = stablehlo.convolution(%218, %arg49) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x192x1x1xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %220 = stablehlo.reshape %arg48 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %221 = stablehlo.reshape %220 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %222 = stablehlo.reshape %arg47 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %223 = stablehlo.reshape %222 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %224 = stablehlo.reshape %arg46 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %225 = stablehlo.reshape %224 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %226 = "stablehlo.batch_norm_inference"(%219, %221, %223, %225, %194) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x192x14x14xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %227 = stablehlo.maximum %226, %cst_15 : tensor<1x192x14x14xbf16> loc(#loc)
    %228 = stablehlo.convolution(%227, %arg44) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x1x3x3xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %229 = stablehlo.convolution(%228, %arg43) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x192x14x14xbf16>, tensor<192x192x1x1xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %230 = stablehlo.reshape %arg42 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %231 = stablehlo.reshape %230 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %232 = stablehlo.reshape %arg41 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %233 = stablehlo.reshape %232 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %234 = stablehlo.reshape %arg40 : (tensor<192xbf16>) -> tensor<1x1x192xbf16> loc(#loc)
    %235 = stablehlo.reshape %234 : (tensor<1x1x192xbf16>) -> tensor<192xbf16> loc(#loc)
    %236 = "stablehlo.batch_norm_inference"(%229, %231, %233, %235, %196) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x192x14x14xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>, tensor<192xbf16>) -> tensor<1x192x14x14xbf16> loc(#loc)
    %237 = stablehlo.maximum %236, %cst_15 : tensor<1x192x14x14xbf16> loc(#loc)
    %238 = stablehlo.concatenate %188, %217, %227, %237, dim = 1 : (tensor<1x512x14x14xbf16>, tensor<1x192x14x14xbf16>, tensor<1x192x14x14xbf16>, tensor<1x192x14x14xbf16>) -> tensor<1x1088x14x14xbf16> loc(#loc)
    %239 = stablehlo.convolution(%238, %arg38) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x1088x14x14xbf16>, tensor<768x1088x1x1xbf16>) -> tensor<1x768x14x14xbf16> loc(#loc)
    %240 = stablehlo.reshape %arg37 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc)
    %241 = stablehlo.reshape %240 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc)
    %242 = stablehlo.reshape %arg36 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc)
    %243 = stablehlo.reshape %242 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc)
    %244 = stablehlo.reshape %arg35 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc)
    %245 = stablehlo.reshape %244 : (tensor<1x1x768xbf16>) -> tensor<768xbf16> loc(#loc)
    %246 = "stablehlo.batch_norm_inference"(%239, %241, %243, %245, %198) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x768x14x14xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>, tensor<768xbf16>) -> tensor<1x768x14x14xbf16> loc(#loc)
    %247 = stablehlo.maximum %246, %cst_14 : tensor<1x768x14x14xbf16> loc(#loc)
    %248 = stablehlo.reduce(%247 init: %cst_36) applies stablehlo.add across dimensions = [2, 3] : (tensor<1x768x14x14xbf16>, tensor<bf16>) -> tensor<1x768xbf16> loc(#loc)
    %249 = stablehlo.multiply %248, %cst_11 : tensor<1x768xbf16> loc(#loc)
    %250 = stablehlo.reshape %249 : (tensor<1x768xbf16>) -> tensor<1x768x1x1xbf16> loc(#loc)
    %251 = stablehlo.convolution(%250, %arg33) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x768x1x1xbf16>, tensor<768x768x1x1xbf16>) -> tensor<1x768x1x1xbf16> loc(#loc)
    %252 = stablehlo.reshape %arg32 : (tensor<768xbf16>) -> tensor<1x1x768xbf16> loc(#loc)
    %253 = stablehlo.reshape %252 : (tensor<1x1x768xbf16>) -> tensor<1x768x1x1xbf16> loc(#loc)
    %254 = stablehlo.add %251, %253 : tensor<1x768x1x1xbf16> loc(#loc)
    %255 = stablehlo.convert %254 : (tensor<1x768x1x1xbf16>) -> tensor<1x768x1x1xf32> loc(#loc)
    %256 = stablehlo.add %255, %cst_10 : tensor<1x768x1x1xf32> loc(#loc)
    %257 = stablehlo.clamp %cst_12, %256, %cst_9 : tensor<1x768x1x1xf32> loc(#loc)
    %258 = stablehlo.clamp %cst_13, %257, %cst_8 : tensor<1x768x1x1xf32> loc(#loc)
    %259 = stablehlo.divide %258, %cst_8 : tensor<1x768x1x1xf32> loc(#loc)
    %260 = stablehlo.convert %259 : (tensor<1x768x1x1xf32>) -> tensor<1x768x1x1xbf16> loc(#loc)
    %261 = stablehlo.reshape %260 : (tensor<1x768x1x1xbf16>) -> tensor<1x768xbf16> loc(#loc)
    %262 = stablehlo.broadcast_in_dim %261, dims = [0, 1] : (tensor<1x768xbf16>) -> tensor<1x768x14x14xbf16> loc(#loc)
    %263 = stablehlo.multiply %247, %262 : tensor<1x768x14x14xbf16> loc(#loc)
    %264 = stablehlo.pad %263, %cst_34, low = [0, 0, 0, 0], high = [0, 0, 1, 1], interior = [0, 0, 0, 0] : (tensor<1x768x14x14xbf16>, tensor<bf16>) -> tensor<1x768x15x15xbf16> loc(#loc)
    %265 = "stablehlo.reduce_window"(%264, %cst_34) <{window_dimensions = array<i64: 1, 1, 3, 3>, window_strides = array<i64: 1, 1, 2, 2>}> ({
    ^bb0(%arg140: tensor<bf16> loc(unknown), %arg141: tensor<bf16> loc(unknown)):
      %359 = stablehlo.maximum %arg140, %arg141 : tensor<bf16> loc(#loc)
      stablehlo.return %359 : tensor<bf16> loc(#loc)
    }) : (tensor<1x768x15x15xbf16>, tensor<bf16>) -> tensor<1x768x7x7xbf16> loc(#loc)
    %266 = stablehlo.reshape %arg27 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %267 = stablehlo.reshape %266 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %268 = stablehlo.reshape %arg21 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %269 = stablehlo.reshape %268 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %270 = stablehlo.reshape %arg15 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %271 = stablehlo.reshape %270 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %272 = stablehlo.reshape %arg9 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %273 = stablehlo.reshape %272 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %274 = stablehlo.reshape %arg4 : (tensor<1024xbf16>) -> tensor<1x1x1024xbf16> loc(#loc)
    %275 = stablehlo.reshape %274 : (tensor<1x1x1024xbf16>) -> tensor<1024xbf16> loc(#loc)
    %276 = stablehlo.convolution(%265, %arg31) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x768x7x7xbf16>, tensor<224x768x1x1xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %277 = stablehlo.reshape %arg30 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %278 = stablehlo.reshape %277 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %279 = stablehlo.reshape %arg29 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %280 = stablehlo.reshape %279 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %281 = stablehlo.reshape %arg28 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %282 = stablehlo.reshape %281 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %283 = "stablehlo.batch_norm_inference"(%276, %278, %280, %282, %267) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x224x7x7xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %284 = stablehlo.maximum %283, %cst_7 : tensor<1x224x7x7xbf16> loc(#loc)
    %285 = stablehlo.convolution(%284, %arg26) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 224 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x1x3x3xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %286 = stablehlo.convolution(%285, %arg25) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x224x1x1xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %287 = stablehlo.reshape %arg24 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %288 = stablehlo.reshape %287 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %289 = stablehlo.reshape %arg23 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %290 = stablehlo.reshape %289 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %291 = stablehlo.reshape %arg22 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %292 = stablehlo.reshape %291 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %293 = "stablehlo.batch_norm_inference"(%286, %288, %290, %292, %269) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x224x7x7xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %294 = stablehlo.maximum %293, %cst_7 : tensor<1x224x7x7xbf16> loc(#loc)
    %295 = stablehlo.convolution(%294, %arg20) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 224 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x1x3x3xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %296 = stablehlo.convolution(%295, %arg19) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x224x1x1xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %297 = stablehlo.reshape %arg18 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %298 = stablehlo.reshape %297 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %299 = stablehlo.reshape %arg17 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %300 = stablehlo.reshape %299 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %301 = stablehlo.reshape %arg16 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %302 = stablehlo.reshape %301 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %303 = "stablehlo.batch_norm_inference"(%296, %298, %300, %302, %271) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x224x7x7xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>, tensor<224xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %304 = stablehlo.maximum %303, %cst_7 : tensor<1x224x7x7xbf16> loc(#loc)
    %305 = stablehlo.convolution(%304, %arg14) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 224 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x1x3x3xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %306 = stablehlo.convolution(%305, %arg13) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x224x7x7xbf16>, tensor<224x224x1x1xbf16>) -> tensor<1x224x7x7xbf16> loc(#loc)
    %307 = stablehlo.reshape %arg12 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %308 = stablehlo.reshape %307 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %309 = stablehlo.reshape %arg11 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %310 = stablehlo.reshape %309 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
    %311 = stablehlo.reshape %arg10 : (tensor<224xbf16>) -> tensor<1x1x224xbf16> loc(#loc)
    %312 = stablehlo.reshape %311 : (tensor<1x1x224xbf16>) -> tensor<224xbf16> loc(#loc)
