#loc1 = loc("p0.3")
#loc2 = loc("p1.11")
#loc3 = loc("p2.24")
#loc4 = loc("p3.28")
#loc5 = loc("p4.30")
#loc6 = loc("p5.34")
#loc7 = loc("p6.38")
#loc8 = loc("p7.42")
#loc9 = loc("p8.46")
#loc10 = loc("p9.48")
#loc11 = loc("p10.52")
#loc12 = loc("p11.56")
#loc13 = loc("p12.60")
#loc14 = loc("p13.64")
#loc15 = loc("p14.66")
#loc16 = loc("p15.68")
#loc17 = loc("p16.72")
#loc18 = loc("p17.76")
#loc19 = loc("p18.80")
#loc20 = loc("p19.84")
#loc21 = loc("p20.86")
#loc22 = loc("p21.88")
#loc23 = loc("p22.92")
#loc24 = loc("p23.96")
#loc25 = loc("p24.100")
#loc26 = loc("p25.104")
#loc27 = loc("p26.106")
#loc28 = loc("p27.108")
#loc29 = loc("p28.112")
#loc30 = loc("p29.116")
#loc31 = loc("p30.120")
#loc32 = loc("p31.124")
#loc33 = loc("p32.133")
#loc34 = loc("p33.137")
#loc35 = loc("p34.139")
#loc36 = loc("p35.143")
#loc37 = loc("p36.147")
#loc38 = loc("p37.151")
#loc39 = loc("p38.155")
#loc40 = loc("p39.157")
#loc41 = loc("p40.161")
#loc42 = loc("p41.165")
#loc43 = loc("p42.169")
#loc44 = loc("p43.173")
#loc45 = loc("p44.175")
#loc46 = loc("p45.177")
#loc47 = loc("p46.181")
#loc48 = loc("p47.185")
#loc49 = loc("p48.189")
#loc50 = loc("p49.193")
#loc51 = loc("p50.195")
#loc52 = loc("p51.197")
#loc53 = loc("p52.201")
#loc54 = loc("p53.205")
#loc55 = loc("p54.209")
#loc56 = loc("p55.213")
#loc57 = loc("p56.215")
#loc58 = loc("p57.217")
#loc59 = loc("p58.221")
#loc60 = loc("p59.225")
#loc61 = loc("p60.229")
#loc62 = loc("p61.233")
#loc63 = loc("p62.242")
#loc64 = loc("p63.246")
#loc65 = loc("p64.248")
#loc66 = loc("p65.252")
#loc67 = loc("p66.256")
#loc68 = loc("p67.260")
#loc69 = loc("p68.264")
#loc70 = loc("p69.266")
#loc71 = loc("p70.270")
#loc72 = loc("p71.274")
#loc73 = loc("p72.278")
#loc74 = loc("p73.282")
#loc75 = loc("p74.284")
#loc76 = loc("p75.286")
#loc77 = loc("p76.290")
#loc78 = loc("p77.294")
#loc79 = loc("p78.298")
#loc80 = loc("p79.302")
#loc81 = loc("p80.304")
#loc82 = loc("p81.306")
#loc83 = loc("p82.310")
#loc84 = loc("p83.314")
#loc85 = loc("p84.318")
#loc86 = loc("p85.322")
#loc87 = loc("p86.324")
#loc88 = loc("p87.326")
#loc89 = loc("p88.330")
#loc90 = loc("p89.334")
#loc91 = loc("p90.338")
#loc92 = loc("p91.342")
#loc93 = loc("p92.351")
#loc94 = loc("p93.355")
#loc95 = loc("p94.357")
#loc96 = loc("p95.361")
#loc97 = loc("p96.365")
#loc98 = loc("p97.369")
#loc99 = loc("p98.373")
#loc100 = loc("p99.375")
#loc101 = loc("p100.379")
#loc102 = loc("p101.383")
#loc103 = loc("p102.387")
#loc104 = loc("p103.391")
#loc105 = loc("p104.393")
#loc106 = loc("p105.395")
#loc107 = loc("p106.399")
#loc108 = loc("p107.403")
#loc109 = loc("p108.407")
#loc110 = loc("p109.411")
#loc111 = loc("p110.413")
#loc112 = loc("p111.415")
#loc113 = loc("p112.419")
#loc114 = loc("p113.423")
#loc115 = loc("p114.427")
#loc116 = loc("p115.431")
#loc117 = loc("p116.433")
#loc118 = loc("p117.435")
#loc119 = loc("p118.439")
#loc120 = loc("p119.443")
#loc121 = loc("p120.447")
#loc122 = loc("p121.451")
#loc123 = loc("p122.453")
#loc124 = loc("p123.457")
#loc125 = loc("p124.461")
#loc126 = loc("p125.465")
#loc127 = loc("p126.469")
#loc128 = loc("p127.471")
#loc129 = loc("p128.473")
#loc130 = loc("p129.477")
#loc131 = loc("p130.481")
#loc132 = loc("p131.485")
#loc133 = loc("p132.489")
#loc134 = loc("p133.491")
#loc135 = loc("p134.493")
#loc136 = loc("p135.497")
#loc137 = loc("p136.501")
#loc138 = loc("p137.505")
#loc139 = loc("p138.509")
#loc140 = loc("p139.511")
#loc300 = loc("reduce-window.639")
#loc408 = loc("reduce-window.897")
#loc516 = loc("reduce-window.1155")
module @SyncTensorsGraph.1433 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<1000xbf16> loc("p0.3"), %arg1: tensor<1000x1024xbf16> loc("p1.11"), %arg2: tensor<1024xbf16> loc("p2.24"), %arg3: tensor<1024x1024x1x1xbf16> loc("p3.28"), %arg4: tensor<1024xbf16> loc("p4.30"), %arg5: tensor<1024xbf16> loc("p5.34"), %arg6: tensor<1024xbf16> loc("p6.38"), %arg7: tensor<1024xbf16> loc("p7.42"), %arg8: tensor<1024x1440x1x1xbf16> loc("p8.46"), %arg9: tensor<224xbf16> loc("p9.48"), %arg10: tensor<224xbf16> loc("p10.52"), %arg11: tensor<224xbf16> loc("p11.56"), %arg12: tensor<224xbf16> loc("p12.60"), %arg13: tensor<224x224x1x1xbf16> loc("p13.64"), %arg14: tensor<224x1x3x3xbf16> loc("p14.66"), %arg15: tensor<224xbf16> loc("p15.68"), %arg16: tensor<224xbf16> loc("p16.72"), %arg17: tensor<224xbf16> loc("p17.76"), %arg18: tensor<224xbf16> loc("p18.80"), %arg19: tensor<224x224x1x1xbf16> loc("p19.84"), %arg20: tensor<224x1x3x3xbf16> loc("p20.86"), %arg21: tensor<224xbf16> loc("p21.88"), %arg22: tensor<224xbf16> loc("p22.92"), %arg23: tensor<224xbf16> loc("p23.96"), %arg24: tensor<224xbf16> loc("p24.100"), %arg25: tensor<224x224x1x1xbf16> loc("p25.104"), %arg26: tensor<224x1x3x3xbf16> loc("p26.106"), %arg27: tensor<224xbf16> loc("p27.108"), %arg28: tensor<224xbf16> loc("p28.112"), %arg29: tensor<224xbf16> loc("p29.116"), %arg30: tensor<224xbf16> loc("p30.120"), %arg31: tensor<224x768x1x1xbf16> loc("p31.124"), %arg32: tensor<768xbf16> loc("p32.133"), %arg33: tensor<768x768x1x1xbf16> loc("p33.137"), %arg34: tensor<768xbf16> loc("p34.139"), %arg35: tensor<768xbf16> loc("p35.143"), %arg36: tensor<768xbf16> loc("p36.147"), %arg37: tensor<768xbf16> loc("p37.151"), %arg38: tensor<768x1088x1x1xbf16> loc("p38.155"), %arg39: tensor<192xbf16> loc("p39.157"), %arg40: tensor<192xbf16> loc("p40.161"), %arg41: tensor<192xbf16> loc("p41.165"), %arg42: tensor<192xbf16> loc("p42.169"), %arg43: tensor<192x192x1x1xbf16> loc("p43.173"), %arg44: tensor<192x1x3x3xbf16> loc("p44.175"), %arg45: tensor<192xbf16> loc("p45.177"), %arg46: tensor<192xbf16> loc("p46.181"), %arg47: tensor<192xbf16> loc("p47.185"), %arg48: tensor<192xbf16> loc("p48.189"), %arg49: tensor<192x192x1x1xbf16> loc("p49.193"), %arg50: tensor<192x1x3x3xbf16> loc("p50.195"), %arg51: tensor<192xbf16> loc("p51.197"), %arg52: tensor<192xbf16> loc("p52.201"), %arg53: tensor<192xbf16> loc("p53.205"), %arg54: tensor<192xbf16> loc("p54.209"), %arg55: tensor<192x192x1x1xbf16> loc("p55.213"), %arg56: tensor<192x1x3x3xbf16> loc("p56.215"), %arg57: tensor<192xbf16> loc("p57.217"), %arg58: tensor<192xbf16> loc("p58.221"), %arg59: tensor<192xbf16> loc("p59.225"), %arg60: tensor<192xbf16> loc("p60.229"), %arg61: tensor<192x512x1x1xbf16> loc("p61.233"), %arg62: tensor<512xbf16> loc("p62.242"), %arg63: tensor<512x512x1x1xbf16> loc("p63.246"), %arg64: tensor<512xbf16> loc("p64.248"), %arg65: tensor<512xbf16> loc("p65.252"), %arg66: tensor<512xbf16> loc("p66.256"), %arg67: tensor<512xbf16> loc("p67.260"), %arg68: tensor<512x736x1x1xbf16> loc("p68.264"), %arg69: tensor<160xbf16> loc("p69.266"), %arg70: tensor<160xbf16> loc("p70.270"), %arg71: tensor<160xbf16> loc("p71.274"), %arg72: tensor<160xbf16> loc("p72.278"), %arg73: tensor<160x160x1x1xbf16> loc("p73.282"), %arg74: tensor<160x1x3x3xbf16> loc("p74.284"), %arg75: tensor<160xbf16> loc("p75.286"), %arg76: tensor<160xbf16> loc("p76.290"), %arg77: tensor<160xbf16> loc("p77.294"), %arg78: tensor<160xbf16> loc("p78.298"), %arg79: tensor<160x160x1x1xbf16> loc("p79.302"), %arg80: tensor<160x1x3x3xbf16> loc("p80.304"), %arg81: tensor<160xbf16> loc("p81.306"), %arg82: tensor<160xbf16> loc("p82.310"), %arg83: tensor<160xbf16> loc("p83.314"), %arg84: tensor<160xbf16> loc("p84.318"), %arg85: tensor<160x160x1x1xbf16> loc("p85.322"), %arg86: tensor<160x1x3x3xbf16> loc("p86.324"), %arg87: tensor<160xbf16> loc("p87.326"), %arg88: tensor<160xbf16> loc("p88.330"), %arg89: tensor<160xbf16> loc("p89.334"), %arg90: tensor<160xbf16> loc("p90.338"), %arg91: tensor<160x256x1x1xbf16> loc("p91.342"), %arg92: tensor<256xbf16> loc("p92.351"), %arg93: tensor<256x256x1x1xbf16> loc("p93.355"), %arg94: tensor<256xbf16> loc("p94.357"), %arg95: tensor<256xbf16> loc("p95.361"), %arg96: tensor<256xbf16> loc("p96.365"), %arg97: tensor<256xbf16> loc("p97.369"), %arg98: tensor<256x448x1x1xbf16> loc("p98.373"), %arg99: tensor<128xbf16> loc("p99.375"), %arg100: tensor<128xbf16> loc("p100.379"), %arg101: tensor<128xbf16> loc("p101.383"), %arg102: tensor<128xbf16> loc("p102.387"), %arg103: tensor<128x128x1x1xbf16> loc("p103.391"), %arg104: tensor<128x1x3x3xbf16> loc("p104.393"), %arg105: tensor<128xbf16> loc("p105.395"), %arg106: tensor<128xbf16> loc("p106.399"), %arg107: tensor<128xbf16> loc("p107.403"), %arg108: tensor<128xbf16> loc("p108.407"), %arg109: tensor<128x128x1x1xbf16> loc("p109.411"), %arg110: tensor<128x1x3x3xbf16> loc("p110.413"), %arg111: tensor<128xbf16> loc("p111.415"), %arg112: tensor<128xbf16> loc("p112.419"), %arg113: tensor<128xbf16> loc("p113.423"), %arg114: tensor<128xbf16> loc("p114.427"), %arg115: tensor<128x128x1x1xbf16> loc("p115.431"), %arg116: tensor<128x1x3x3xbf16> loc("p116.433"), %arg117: tensor<128xbf16> loc("p117.435"), %arg118: tensor<128xbf16> loc("p118.439"), %arg119: tensor<128xbf16> loc("p119.443"), %arg120: tensor<128xbf16> loc("p120.447"), %arg121: tensor<128x64x1x1xbf16> loc("p121.451"), %arg122: tensor<64xbf16> loc("p122.453"), %arg123: tensor<64xbf16> loc("p123.457"), %arg124: tensor<64xbf16> loc("p124.461"), %arg125: tensor<64xbf16> loc("p125.465"), %arg126: tensor<64x64x1x1xbf16> loc("p126.469"), %arg127: tensor<64x1x3x3xbf16> loc("p127.471"), %arg128: tensor<64xbf16> loc("p128.473"), %arg129: tensor<64xbf16> loc("p129.477"), %arg130: tensor<64xbf16> loc("p130.481"), %arg131: tensor<64xbf16> loc("p131.485"), %arg132: tensor<64x64x1x1xbf16> loc("p132.489"), %arg133: tensor<64x1x3x3xbf16> loc("p133.491"), %arg134: tensor<64xbf16> loc("p134.493"), %arg135: tensor<64xbf16> loc("p135.497"), %arg136: tensor<64xbf16> loc("p136.501"), %arg137: tensor<64xbf16> loc("p137.505"), %arg138: tensor<64x3x3x3xbf16> loc("p138.509"), %arg139: tensor<1x3x224x224xbf16> loc("p139.511")) -> tensor<1x1000xbf16> {
    %cst = stablehlo.constant dense<0.0204081628> : tensor<1x1024xf32> loc(#loc)
    %cst_0 = stablehlo.constant dense<6.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<3.40282347E+38> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<3.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_3 = stablehlo.constant dense<2.038570e-02> : tensor<1x1024xbf16> loc(#loc)
    %cst_4 = stablehlo.constant dense<0.000000e+00> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_5 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x1024x1x1xf32> loc(#loc)
    %cst_6 = stablehlo.constant dense<0.000000e+00> : tensor<1x1024x7x7xbf16> loc(#loc)
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<1x224x7x7xbf16> loc(#loc)
    %cst_8 = stablehlo.constant dense<6.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_9 = stablehlo.constant dense<3.40282347E+38> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_10 = stablehlo.constant dense<3.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_11 = stablehlo.constant dense<5.096440e-03> : tensor<1x768xbf16> loc(#loc)
    %cst_12 = stablehlo.constant dense<0.000000e+00> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_13 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x768x1x1xf32> loc(#loc)
    %cst_14 = stablehlo.constant dense<0.000000e+00> : tensor<1x768x14x14xbf16> loc(#loc)
    %cst_15 = stablehlo.constant dense<0.000000e+00> : tensor<1x192x14x14xbf16> loc(#loc)
    %cst_16 = stablehlo.constant dense<6.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_17 = stablehlo.constant dense<3.40282347E+38> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_18 = stablehlo.constant dense<3.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_19 = stablehlo.constant dense<1.274110e-03> : tensor<1x512xbf16> loc(#loc)
    %cst_20 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_21 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x512x1x1xf32> loc(#loc)
    %cst_22 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x28x28xbf16> loc(#loc)
    %cst_23 = stablehlo.constant dense<0.000000e+00> : tensor<1x160x28x28xbf16> loc(#loc)
    %cst_24 = stablehlo.constant dense<6.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_25 = stablehlo.constant dense<3.40282347E+38> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_26 = stablehlo.constant dense<3.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_27 = stablehlo.constant dense<3.185270e-04> : tensor<1x256xbf16> loc(#loc)
    %cst_28 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_29 = stablehlo.constant dense<-3.40282347E+38> : tensor<1x256x1x1xf32> loc(#loc)
    %cst_30 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x56x56xbf16> loc(#loc)
    %cst_31 = stablehlo.constant dense<0.000000e+00> : tensor<1x128x56x56xbf16> loc(#loc)
    %cst_32 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x56x56xbf16> loc(#loc)
    %cst_33 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x112x112xbf16> loc(#loc)
    %cst_34 = stablehlo.constant dense<0xFF80> : tensor<bf16> loc(#loc)
    %cst_35 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_36 = stablehlo.constant dense<0.000000e+00> : tensor<bf16> loc(#loc)
    %0 = stablehlo.reshape %arg134 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc141)
    %1 = stablehlo.custom_call @tt.mark_argument(%0) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.0.bn.running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc142)
    %2 = stablehlo.reshape %1 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc143)
    %3 = stablehlo.reshape %arg128 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc144)
    %4 = stablehlo.custom_call @tt.mark_argument(%3) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.1.bn.running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc145)
    %5 = stablehlo.reshape %4 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc146)
    %6 = stablehlo.reshape %arg122 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc147)
    %7 = stablehlo.custom_call @tt.mark_argument(%6) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.2.bn.running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc148)
    %8 = stablehlo.reshape %7 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc149)
    %9 = stablehlo.reshape %arg117 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc150)
    %10 = stablehlo.custom_call @tt.mark_argument(%9) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_reduction.bn.running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc151)
    %11 = stablehlo.reshape %10 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc152)
    %12 = stablehlo.reshape %arg111 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc153)
    %13 = stablehlo.custom_call @tt.mark_argument(%12) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.0.bn.running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc154)
    %14 = stablehlo.reshape %13 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc155)
    %15 = stablehlo.reshape %arg105 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc156)
    %16 = stablehlo.custom_call @tt.mark_argument(%15) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.1.bn.running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc157)
    %17 = stablehlo.reshape %16 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc158)
    %18 = stablehlo.reshape %arg99 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc159)
    %19 = stablehlo.custom_call @tt.mark_argument(%18) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.2.bn.running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc160)
    %20 = stablehlo.reshape %19 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc161)
    %21 = stablehlo.reshape %arg94 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc162)
    %22 = stablehlo.custom_call @tt.mark_argument(%21) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_concat.bn.running_var"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc163)
    %23 = stablehlo.reshape %22 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc164)
    %24 = stablehlo.custom_call @tt.mark_argument(%arg139) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_0"}} : (tensor<1x3x224x224xbf16>) -> tensor<1x3x224x224xbf16> loc(#loc165)
    %25 = stablehlo.custom_call @tt.mark_argument(%arg138) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.0.conv.weight"}} : (tensor<64x3x3x3xbf16>) -> tensor<64x3x3x3xbf16> loc(#loc166)
    %26 = stablehlo.convolution(%24, %25) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x3x224x224xbf16>, tensor<64x3x3x3xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc167)
    %27 = stablehlo.reshape %arg137 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc168)
    %28 = stablehlo.custom_call @tt.mark_argument(%27) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.0.bn.weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc169)
    %29 = stablehlo.reshape %28 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc170)
    %30 = stablehlo.reshape %arg136 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc171)
    %31 = stablehlo.custom_call @tt.mark_argument(%30) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.0.bn.bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc172)
    %32 = stablehlo.reshape %31 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc173)
    %33 = stablehlo.reshape %arg135 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc174)
    %34 = stablehlo.custom_call @tt.mark_argument(%33) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.0.bn.running_mean"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc175)
    %35 = stablehlo.reshape %34 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc176)
    %36 = "stablehlo.batch_norm_inference"(%26, %29, %32, %35, %2) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x112x112xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc177)
    %37 = stablehlo.maximum %36, %cst_33 : tensor<1x64x112x112xbf16> loc(#loc178)
    %38 = stablehlo.custom_call @tt.mark_argument(%arg133) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.1.conv_dw.weight"}} : (tensor<64x1x3x3xbf16>) -> tensor<64x1x3x3xbf16> loc(#loc179)
    %39 = stablehlo.convolution(%37, %38) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 64 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x1x3x3xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc180)
    %40 = stablehlo.custom_call @tt.mark_argument(%arg132) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.1.conv_pw.weight"}} : (tensor<64x64x1x1xbf16>) -> tensor<64x64x1x1xbf16> loc(#loc181)
    %41 = stablehlo.convolution(%39, %40) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x64x1x1xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc182)
    %42 = stablehlo.reshape %arg131 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc183)
    %43 = stablehlo.custom_call @tt.mark_argument(%42) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.1.bn.weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc184)
    %44 = stablehlo.reshape %43 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc185)
    %45 = stablehlo.reshape %arg130 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc186)
    %46 = stablehlo.custom_call @tt.mark_argument(%45) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.1.bn.bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc187)
    %47 = stablehlo.reshape %46 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc188)
    %48 = stablehlo.reshape %arg129 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc189)
    %49 = stablehlo.custom_call @tt.mark_argument(%48) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.1.bn.running_mean"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc190)
    %50 = stablehlo.reshape %49 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc191)
    %51 = "stablehlo.batch_norm_inference"(%41, %44, %47, %50, %5) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x112x112xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x112x112xbf16> loc(#loc192)
    %52 = stablehlo.maximum %51, %cst_33 : tensor<1x64x112x112xbf16> loc(#loc193)
    %53 = stablehlo.custom_call @tt.mark_argument(%arg127) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.2.conv_dw.weight"}} : (tensor<64x1x3x3xbf16>) -> tensor<64x1x3x3xbf16> loc(#loc194)
    %54 = stablehlo.convolution(%52, %53) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 64 : i64} : (tensor<1x64x112x112xbf16>, tensor<64x1x3x3xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc195)
    %55 = stablehlo.custom_call @tt.mark_argument(%arg126) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.2.conv_pw.weight"}} : (tensor<64x64x1x1xbf16>) -> tensor<64x64x1x1xbf16> loc(#loc196)
    %56 = stablehlo.convolution(%54, %55) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xbf16>, tensor<64x64x1x1xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc197)
    %57 = stablehlo.reshape %arg125 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc198)
    %58 = stablehlo.custom_call @tt.mark_argument(%57) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.2.bn.weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc199)
    %59 = stablehlo.reshape %58 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc200)
    %60 = stablehlo.reshape %arg124 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc201)
    %61 = stablehlo.custom_call @tt.mark_argument(%60) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stem.2.bn.bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc202)
    %62 = stablehlo.reshape %61 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc203)
    %63 = stablehlo.reshape %arg123 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc204)
    %64 = stablehlo.custom_call @tt.mark_argument(%63) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stem.2.bn.running_mean"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc205)
    %65 = stablehlo.reshape %64 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc206)
    %66 = "stablehlo.batch_norm_inference"(%56, %59, %62, %65, %8) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x56x56xbf16> loc(#loc207)
    %67 = stablehlo.maximum %66, %cst_32 : tensor<1x64x56x56xbf16> loc(#loc208)
    %68 = stablehlo.custom_call @tt.mark_argument(%arg121) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_reduction.conv.weight"}} : (tensor<128x64x1x1xbf16>) -> tensor<128x64x1x1xbf16> loc(#loc209)
    %69 = stablehlo.convolution(%67, %68) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xbf16>, tensor<128x64x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc210)
    %70 = stablehlo.reshape %arg120 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc211)
    %71 = stablehlo.custom_call @tt.mark_argument(%70) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_reduction.bn.weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc212)
    %72 = stablehlo.reshape %71 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc213)
    %73 = stablehlo.reshape %arg119 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc214)
    %74 = stablehlo.custom_call @tt.mark_argument(%73) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_reduction.bn.bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc215)
    %75 = stablehlo.reshape %74 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc216)
    %76 = stablehlo.reshape %arg118 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc217)
    %77 = stablehlo.custom_call @tt.mark_argument(%76) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_reduction.bn.running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc218)
    %78 = stablehlo.reshape %77 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc219)
    %79 = "stablehlo.batch_norm_inference"(%69, %72, %75, %78, %11) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc220)
    %80 = stablehlo.maximum %79, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc221)
    %81 = stablehlo.custom_call @tt.mark_argument(%arg116) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.0.conv_dw.weight"}} : (tensor<128x1x3x3xbf16>) -> tensor<128x1x3x3xbf16> loc(#loc222)
    %82 = stablehlo.convolution(%80, %81) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc223)
    %83 = stablehlo.custom_call @tt.mark_argument(%arg115) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.0.conv_pw.weight"}} : (tensor<128x128x1x1xbf16>) -> tensor<128x128x1x1xbf16> loc(#loc224)
    %84 = stablehlo.convolution(%82, %83) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc225)
    %85 = stablehlo.reshape %arg114 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc226)
    %86 = stablehlo.custom_call @tt.mark_argument(%85) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.0.bn.weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc227)
    %87 = stablehlo.reshape %86 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc228)
    %88 = stablehlo.reshape %arg113 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc229)
    %89 = stablehlo.custom_call @tt.mark_argument(%88) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.0.bn.bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc230)
    %90 = stablehlo.reshape %89 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc231)
    %91 = stablehlo.reshape %arg112 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc232)
    %92 = stablehlo.custom_call @tt.mark_argument(%91) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.0.bn.running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc233)
    %93 = stablehlo.reshape %92 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc234)
    %94 = "stablehlo.batch_norm_inference"(%84, %87, %90, %93, %14) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc235)
    %95 = stablehlo.maximum %94, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc236)
    %96 = stablehlo.custom_call @tt.mark_argument(%arg110) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.1.conv_dw.weight"}} : (tensor<128x1x3x3xbf16>) -> tensor<128x1x3x3xbf16> loc(#loc237)
    %97 = stablehlo.convolution(%95, %96) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc238)
    %98 = stablehlo.custom_call @tt.mark_argument(%arg109) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.1.conv_pw.weight"}} : (tensor<128x128x1x1xbf16>) -> tensor<128x128x1x1xbf16> loc(#loc239)
    %99 = stablehlo.convolution(%97, %98) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc240)
    %100 = stablehlo.reshape %arg108 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc241)
    %101 = stablehlo.custom_call @tt.mark_argument(%100) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.1.bn.weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc242)
    %102 = stablehlo.reshape %101 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc243)
    %103 = stablehlo.reshape %arg107 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc244)
    %104 = stablehlo.custom_call @tt.mark_argument(%103) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.1.bn.bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc245)
    %105 = stablehlo.reshape %104 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc246)
    %106 = stablehlo.reshape %arg106 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc247)
    %107 = stablehlo.custom_call @tt.mark_argument(%106) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.1.bn.running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc248)
    %108 = stablehlo.reshape %107 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc249)
    %109 = "stablehlo.batch_norm_inference"(%99, %102, %105, %108, %17) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc250)
    %110 = stablehlo.maximum %109, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc251)
    %111 = stablehlo.custom_call @tt.mark_argument(%arg104) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.2.conv_dw.weight"}} : (tensor<128x1x3x3xbf16>) -> tensor<128x1x3x3xbf16> loc(#loc252)
    %112 = stablehlo.convolution(%110, %111) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x1x3x3xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc253)
    %113 = stablehlo.custom_call @tt.mark_argument(%arg103) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.2.conv_pw.weight"}} : (tensor<128x128x1x1xbf16>) -> tensor<128x128x1x1xbf16> loc(#loc254)
    %114 = stablehlo.convolution(%112, %113) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xbf16>, tensor<128x128x1x1xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc255)
    %115 = stablehlo.reshape %arg102 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc256)
    %116 = stablehlo.custom_call @tt.mark_argument(%115) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.2.bn.weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc257)
    %117 = stablehlo.reshape %116 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc258)
    %118 = stablehlo.reshape %arg101 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc259)
    %119 = stablehlo.custom_call @tt.mark_argument(%118) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_mid.2.bn.bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc260)
    %120 = stablehlo.reshape %119 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc261)
    %121 = stablehlo.reshape %arg100 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc262)
    %122 = stablehlo.custom_call @tt.mark_argument(%121) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_mid.2.bn.running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc263)
    %123 = stablehlo.reshape %122 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc264)
    %124 = "stablehlo.batch_norm_inference"(%114, %117, %120, %123, %20) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x56x56xbf16> loc(#loc265)
    %125 = stablehlo.maximum %124, %cst_31 : tensor<1x128x56x56xbf16> loc(#loc266)
    %126 = stablehlo.concatenate %67, %95, %110, %125, dim = 1 : (tensor<1x64x56x56xbf16>, tensor<1x128x56x56xbf16>, tensor<1x128x56x56xbf16>, tensor<1x128x56x56xbf16>) -> tensor<1x448x56x56xbf16> loc(#loc267)
    %127 = stablehlo.custom_call @tt.mark_argument(%arg98) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_concat.conv.weight"}} : (tensor<256x448x1x1xbf16>) -> tensor<256x448x1x1xbf16> loc(#loc268)
    %128 = stablehlo.convolution(%126, %127) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x448x56x56xbf16>, tensor<256x448x1x1xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc269)
    %129 = stablehlo.reshape %arg97 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc270)
    %130 = stablehlo.custom_call @tt.mark_argument(%129) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_concat.bn.weight"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc271)
    %131 = stablehlo.reshape %130 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc272)
    %132 = stablehlo.reshape %arg96 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc273)
    %133 = stablehlo.custom_call @tt.mark_argument(%132) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.conv_concat.bn.bias"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc274)
    %134 = stablehlo.reshape %133 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc275)
    %135 = stablehlo.reshape %arg95 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc276)
    %136 = stablehlo.custom_call @tt.mark_argument(%135) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.0.blocks.0.conv_concat.bn.running_mean"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc277)
    %137 = stablehlo.reshape %136 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc278)
    %138 = "stablehlo.batch_norm_inference"(%128, %131, %134, %137, %23) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc279)
    %139 = stablehlo.maximum %138, %cst_30 : tensor<1x256x56x56xbf16> loc(#loc280)
    %140 = stablehlo.reduce(%139 init: %cst_36) applies stablehlo.add across dimensions = [2, 3] : (tensor<1x256x56x56xbf16>, tensor<bf16>) -> tensor<1x256xbf16> loc(#loc281)
    %141 = stablehlo.multiply %140, %cst_27 : tensor<1x256xbf16> loc(#loc282)
    %142 = stablehlo.reshape %141 : (tensor<1x256xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc283)
    %143 = stablehlo.custom_call @tt.mark_argument(%arg93) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.attn.fc.weight"}} : (tensor<256x256x1x1xbf16>) -> tensor<256x256x1x1xbf16> loc(#loc284)
    %144 = stablehlo.convolution(%142, %143) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x1x1xbf16>, tensor<256x256x1x1xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc285)
    %145 = stablehlo.reshape %arg92 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc286)
    %146 = stablehlo.custom_call @tt.mark_argument(%145) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.0.blocks.0.attn.fc.bias"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc287)
    %147 = stablehlo.reshape %146 : (tensor<1x1x256xbf16>) -> tensor<1x256x1x1xbf16> loc(#loc288)
    %148 = stablehlo.add %144, %147 : tensor<1x256x1x1xbf16> loc(#loc289)
    %149 = stablehlo.convert %148 : (tensor<1x256x1x1xbf16>) -> tensor<1x256x1x1xf32> loc(#loc290)
    %150 = stablehlo.add %149, %cst_26 : tensor<1x256x1x1xf32> loc(#loc291)
    %151 = stablehlo.clamp %cst_28, %150, %cst_25 : tensor<1x256x1x1xf32> loc(#loc292)
    %152 = stablehlo.clamp %cst_29, %151, %cst_24 : tensor<1x256x1x1xf32> loc(#loc293)
    %153 = stablehlo.divide %152, %cst_24 : tensor<1x256x1x1xf32> loc(#loc294)
    %154 = stablehlo.convert %153 : (tensor<1x256x1x1xf32>) -> tensor<1x256x1x1xbf16> loc(#loc295)
    %155 = stablehlo.reshape %154 : (tensor<1x256x1x1xbf16>) -> tensor<1x256xbf16> loc(#loc296)
    %156 = stablehlo.broadcast_in_dim %155, dims = [0, 1] : (tensor<1x256xbf16>) -> tensor<1x256x56x56xbf16> loc(#loc297)
    %157 = stablehlo.multiply %139, %156 : tensor<1x256x56x56xbf16> loc(#loc298)
    %158 = stablehlo.pad %157, %cst_34, low = [0, 0, 0, 0], high = [0, 0, 1, 1], interior = [0, 0, 0, 0] : (tensor<1x256x56x56xbf16>, tensor<bf16>) -> tensor<1x256x57x57xbf16> loc(#loc299)
    %159 = "stablehlo.reduce_window"(%158, %cst_34) <{window_dimensions = array<i64: 1, 1, 3, 3>, window_strides = array<i64: 1, 1, 2, 2>}> ({
    ^bb0(%arg140: tensor<bf16> loc("reduce-window.639"), %arg141: tensor<bf16> loc("reduce-window.639")):
      %499 = stablehlo.maximum %arg140, %arg141 : tensor<bf16> loc(#loc301)
      stablehlo.return %499 : tensor<bf16> loc(#loc)
    }) : (tensor<1x256x57x57xbf16>, tensor<bf16>) -> tensor<1x256x28x28xbf16> loc(#loc300)
    %160 = stablehlo.reshape %arg87 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc302)
    %161 = stablehlo.custom_call @tt.mark_argument(%160) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_reduction.bn.running_var"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc303)
    %162 = stablehlo.reshape %161 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc304)
    %163 = stablehlo.reshape %arg81 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc305)
    %164 = stablehlo.custom_call @tt.mark_argument(%163) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_mid.0.bn.running_var"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc306)
    %165 = stablehlo.reshape %164 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc307)
    %166 = stablehlo.reshape %arg75 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc308)
    %167 = stablehlo.custom_call @tt.mark_argument(%166) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_mid.1.bn.running_var"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc309)
    %168 = stablehlo.reshape %167 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc310)
    %169 = stablehlo.reshape %arg69 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc311)
    %170 = stablehlo.custom_call @tt.mark_argument(%169) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_mid.2.bn.running_var"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc312)
    %171 = stablehlo.reshape %170 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc313)
    %172 = stablehlo.reshape %arg64 : (tensor<512xbf16>) -> tensor<1x1x512xbf16> loc(#loc314)
    %173 = stablehlo.custom_call @tt.mark_argument(%172) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_concat.bn.running_var"}} : (tensor<1x1x512xbf16>) -> tensor<1x1x512xbf16> loc(#loc315)
    %174 = stablehlo.reshape %173 : (tensor<1x1x512xbf16>) -> tensor<512xbf16> loc(#loc316)
    %175 = stablehlo.custom_call @tt.mark_argument(%arg91) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_reduction.conv.weight"}} : (tensor<160x256x1x1xbf16>) -> tensor<160x256x1x1xbf16> loc(#loc317)
    %176 = stablehlo.convolution(%159, %175) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x28x28xbf16>, tensor<160x256x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc318)
    %177 = stablehlo.reshape %arg90 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc319)
    %178 = stablehlo.custom_call @tt.mark_argument(%177) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_reduction.bn.weight"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc320)
    %179 = stablehlo.reshape %178 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc321)
    %180 = stablehlo.reshape %arg89 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc322)
    %181 = stablehlo.custom_call @tt.mark_argument(%180) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_reduction.bn.bias"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc323)
    %182 = stablehlo.reshape %181 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc324)
    %183 = stablehlo.reshape %arg88 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc325)
    %184 = stablehlo.custom_call @tt.mark_argument(%183) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_reduction.bn.running_mean"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc326)
    %185 = stablehlo.reshape %184 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc327)
    %186 = "stablehlo.batch_norm_inference"(%176, %179, %182, %185, %162) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc328)
    %187 = stablehlo.maximum %186, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc329)
    %188 = stablehlo.custom_call @tt.mark_argument(%arg86) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.0.conv_dw.weight"}} : (tensor<160x1x3x3xbf16>) -> tensor<160x1x3x3xbf16> loc(#loc330)
    %189 = stablehlo.convolution(%187, %188) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 160 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x1x3x3xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc331)
    %190 = stablehlo.custom_call @tt.mark_argument(%arg85) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.0.conv_pw.weight"}} : (tensor<160x160x1x1xbf16>) -> tensor<160x160x1x1xbf16> loc(#loc332)
    %191 = stablehlo.convolution(%189, %190) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x160x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc333)
    %192 = stablehlo.reshape %arg84 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc334)
    %193 = stablehlo.custom_call @tt.mark_argument(%192) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.0.bn.weight"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc335)
    %194 = stablehlo.reshape %193 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc336)
    %195 = stablehlo.reshape %arg83 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc337)
    %196 = stablehlo.custom_call @tt.mark_argument(%195) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.0.bn.bias"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc338)
    %197 = stablehlo.reshape %196 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc339)
    %198 = stablehlo.reshape %arg82 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc340)
    %199 = stablehlo.custom_call @tt.mark_argument(%198) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_mid.0.bn.running_mean"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc341)
    %200 = stablehlo.reshape %199 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc342)
    %201 = "stablehlo.batch_norm_inference"(%191, %194, %197, %200, %165) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x160x28x28xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>, tensor<160xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc343)
    %202 = stablehlo.maximum %201, %cst_23 : tensor<1x160x28x28xbf16> loc(#loc344)
    %203 = stablehlo.custom_call @tt.mark_argument(%arg80) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.1.conv_dw.weight"}} : (tensor<160x1x3x3xbf16>) -> tensor<160x1x3x3xbf16> loc(#loc345)
    %204 = stablehlo.convolution(%202, %203) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 160 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x1x3x3xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc346)
    %205 = stablehlo.custom_call @tt.mark_argument(%arg79) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.1.conv_pw.weight"}} : (tensor<160x160x1x1xbf16>) -> tensor<160x160x1x1xbf16> loc(#loc347)
    %206 = stablehlo.convolution(%204, %205) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x160x28x28xbf16>, tensor<160x160x1x1xbf16>) -> tensor<1x160x28x28xbf16> loc(#loc348)
    %207 = stablehlo.reshape %arg78 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc349)
    %208 = stablehlo.custom_call @tt.mark_argument(%207) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.1.bn.weight"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc350)
    %209 = stablehlo.reshape %208 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc351)
    %210 = stablehlo.reshape %arg77 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc352)
    %211 = stablehlo.custom_call @tt.mark_argument(%210) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "stages.1.blocks.0.conv_mid.1.bn.bias"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc353)
    %212 = stablehlo.reshape %211 : (tensor<1x1x160xbf16>) -> tensor<160xbf16> loc(#loc354)
    %213 = stablehlo.reshape %arg76 : (tensor<160xbf16>) -> tensor<1x1x160xbf16> loc(#loc355)
    %214 = stablehlo.custom_call @tt.mark_argument(%213) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "stages.1.blocks.0.conv_mid.1.bn.running_mean"}} : (tensor<1x1x160xbf16>) -> tensor<1x1x160xbf16> loc(#loc356)
